{
  "id": "alain-ducasse-s-pistachio-and-strawberry-dessert-for-the-chelsea-flower-show",
  "title": "Alain Ducasse's pistachio and strawberry dessert for the Chelsea Flower Show",
  "sourceUrl": "https://www.greatbritishchefs.com/recipes/pistachio-strawberry-dessert-chelsea-flower-show-recipe",
  "ingredients": [
    {
      "section": "",
      "items": [
        "30g of icing sugar",
        "100g of butter, softened",
        "2g of salt",
        "1g of fleur de sel",
        "90g of flour",
        "20g of cornflour",
        "1 dash of vanilla extract",
        "170g of milk",
        "170g of single cream",
        "70g of sugar",
        "80g of egg yolk, (about 4 egg yolks)",
        "3g of gelatine leaves",
        "10g of lemon olive oil",
        "20g of pistachio paste",
        "250g of strawberries, frozen",
        "55g of caster sugar",
        "15g of lemon juice",
        "100g of sugar",
        "80g of desiccated coconut",
        "80g of egg white, (about 2 egg whites)",
        "65g of butter, melted",
        "1g of salt",
        "500g of strawberries, fresh",
        "500g of strawberries, frozen",
        "150g of brown sugar",
        "wild strawberries",
        "pistachio nuts"
      ]
    }
  ],
  "instructions": [
    {
      "section": "",
      "steps": [
        "Preheat the oven to 160°C/gas mark 3",
        "To make the crumbly shortbread, mix the icing sugar, butter, the different salts, and end with the flour, cornflour and the vanilla to form breadcrumbs. Bring together and knead briefly until smooth. Don’t over-handle the dough as this will make it greasy and ‘tough’",
        "Roll out the dough to a 1.5cm thickness on a lined, flat baking sheet. Cut the dough using 8cm ring cutters and, leaving the rings on, bake in the oven for 10 minutes until lightly golden and firm to the touch",
        "To make the crème brûlée with pistachio and olive oil, scald the milk and cream in a saucepan then remove from the heat. In a bowl, mix the sugar and the egg yolk then gradually add the milk and cream, mixing together with a wooden spoon",
        "Heat the custard mixture over a bain marie, making sure that the temperature rises no more than 90°C – stir the mix quite often during the cooking as it thickens. Your cream should remain a bit wobbly in the middle",
        "Remove from the stove, set aside to cool to room temperature then weigh out 380g of the custard mix. Soak the gelatine leaves in cold water for about 5 minutes until soft, then squeeze out the liquid and add to the custard along with the olive oil and pistachio paste",
        "Blend the mixture to incorporate it fully, then pour a 1.5cm thick layer on top of the cooked and cooled shortbread, with the rings still in place",
        "Add the shortbread and crème brûlée to the freezer",
        "Meanwhile, make the strawberry marmalade. In a casserole dish, gently heat the strawberries and sugar until the sugar has dissolved and the strawberries have broken down. Slightly increase the heat to thicken the mixture and achieve a marmalade texture",
        "Add the lemon juice, increase the heat and reduce until thick. Allow to cool then reserve in the fridge until needed",
        "Preheat the oven to 150°C/gas mark 2",
        "To make the coconut biscuit, blitz the coconut to form a crumb and mix with the sugar. Add the salt and melted butter and mix to combine. Lightly whip the eggs whites to a soft peak and fold into the mixture",
        "Spread carefully onto a lined baking tray and bake in the oven for 10 minutes. Whilst the dough is still warm and flexible, cut and shape the biscuits around more 8cm rings. Leave to cool on a wire rack",
        "To make the strawberry sorbet, dissolve the sugar in a pan along with all of the strawberries. Pass into a paco jet and freeze for 24 hours. 3 hours before serving, churn the mixture (or blitz the mixture and churn in a regular ice cream maker)",
        "To dress the plate, remove the crème brulées from the freezer, remove the rings and place the coconut biscuit rings around them. Allow to come to room temperature",
        "Surround with the coconut biscuit and decorate the crème brûlée with small dots of marmalade. Add strawberries and pistachio halves to the top and serve alongside a scoop of strawberry sorbet"
      ]
    }
  ],
  "expectedMatches": {
    "step-0": [],
    "step-1": [
      "0-4",
      "0-5",
      "0-0",
      "0-1",
      "0-2",
      "0-9",
      "0-17",
      "0-20",
      "0-21",
      "0-6",
      "0-25",
      "0-15",
      "0-24",
      "0-3"
    ],
    "step-2": [
      "0-1",
      "0-20"
    ],
    "step-3": [
      "0-7",
      "0-10",
      "0-12",
      "0-0",
      "0-9",
      "0-17",
      "0-8",
      "0-15",
      "0-24",
      "0-13",
      "0-19",
      "0-26"
    ],
    "step-4": [
      "0-8"
    ],
    "step-5": [
      "0-11",
      "0-12",
      "0-13",
      "0-26"
    ],
    "step-6": [],
    "step-7": [],
    "step-8": [
      "0-0",
      "0-9",
      "0-17",
      "0-22",
      "0-25",
      "0-6",
      "0-15",
      "0-24",
      "0-14",
      "0-23"
    ],
    "step-9": [
      "0-16",
      "0-12"
    ],
    "step-10": [],
    "step-11": [
      "0-19",
      "0-0",
      "0-1",
      "0-2",
      "0-9",
      "0-17",
      "0-20",
      "0-21",
      "0-18",
      "0-15",
      "0-24",
      "0-10"
    ],
    "step-12": [],
    "step-13": [
      "0-0",
      "0-9",
      "0-17",
      "0-22",
      "0-8",
      "0-25",
      "0-15",
      "0-24",
      "0-14",
      "0-23"
    ],
    "step-14": [
      "0-18"
    ],
    "step-15": [
      "0-22",
      "0-18",
      "0-25",
      "0-13",
      "0-26",
      "0-14",
      "0-23"
    ]
  }
}
