{
  "id": "grilled-skirt-steak-fajitas-recipe",
  "title": "Grilled Skirt Steak Fajitas Recipe",
  "sourceUrl": "https://www.seriouseats.com/grilled-skirt-steak-fajitas-food-lab-recipe",
  "ingredients": [
    {
      "section": "",
      "items": [
        "1/2 cup (120ml) soy sauce",
        "1/2 cup (120ml) lime juice, from 6 to 8 limes",
        "1/2 cup (120ml) canola oil",
        "1/4 cup (55g) packed brown sugar",
        "1 tablespoon chili powder (see note)",
        "3 medium cloves garlic, finely minced (about 1 tablespoon)",
        "2 teaspoons ground cumin seed",
        "2 teaspoons freshly ground black pepper",
        "2 pounds (900g) trimmed skirt steak (about 1 whole steak; see note), cut crosswise into 5- to 6-inch pieces",
        "1 large red bell pepper, stemmed, seeded, and cut into 1/2-inch-wide strips",
        "1 large yellow bell pepper, stemmed, seeded, and cut into 1/2-inch-wide strips",
        "1 large green bell pepper, stemmed, seeded, and cut into 1/2-inch-wide strips",
        "1 white or yellow onion, cut into 1/2-inch slices",
        "12 to 16 fresh flour or corn tortillas, hot",
        "1 recipe guacamole , for serving, if desired",
        "1 recipe pico de gallo , for serving, if desired",
        "Sour cream, shredded cheese, and salsa, for serving, if desired"
      ]
    }
  ],
  "instructions": [
    {
      "section": "",
      "steps": [
        "For the Fajita Marinade: Combine soy sauce, lime juice, canola oil, brown sugar, chili powder, garlic, cumin, and black pepper in a medium bowl and whisk to combine. Transfer 1/2 cup (120ml) marinade to a large bowl and set aside.",
        "For the Steak: Place steaks in a gallon-sized zipper-lock bag and add remaining marinade. Seal bag, squeezing out as much air as possible. Massage bag until meat is fully coated in marinade. Lay flat in the refrigerator, turning every couple of hours, for at least 3 hours and up to 10.",
        "For the Fajitas: While steak marinates, toss peppers and onion in bowl with reserved 1/2 cup marinade. Refrigerate until ready to use.",
        "When ready to cook, remove steaks from marinade, wipe off excess, and transfer to a large plate. Light one chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil grilling grate .",
        "Place a large cast iron skillet over cooler side of grill. Transfer steaks to hot side of grill. Cover and cook for 1 minute. Flip steaks, cover, and cook for another minute. Continue cooking in this manner, flipping and covering, until steaks are well charred and an instant-read thermometer inserted into their center registers 115 to 120째F (46 to 49째C) for medium-rare or 125 to 130째F (52 to 54째C) for medium. Transfer steaks to a large plate, tent with foil, and allow to rest for 10 to 15 minutes.",
        "Meanwhile, transfer cast iron skillet to hot side of grill and allow to preheat for 2 minutes. Add pepper and onion mix and cook, stirring occasionally, until vegetables are softened and beginning to char in spots, about 10 minutes. When vegetables are cooked, transfer steaks to a cutting board and pour any accumulated juices from plate into skillet with vegetables. Toss to coat.",
        "Transfer vegetables to a warm serving platter. Thinly slice meat against the grain and transfer to platter with vegetables. Serve immediately with hot tortillas, guacamole, pico de gallo, and other condiments as desired."
      ]
    }
  ],
  "expectedMatches": {
    "step-0": [
      "0-0",
      "0-2",
      "0-4",
      "0-6",
      "0-3",
      "0-7",
      "0-1",
      "0-5",
      "0-10",
      "0-9",
      "0-11"
    ],
    "step-1": [],
    "step-2": [
      "0-11",
      "0-12",
      "0-10",
      "0-9",
      "0-7"
    ],
    "step-3": [
      "0-2",
      "0-10",
      "0-9",
      "0-11"
    ],
    "step-4": [
      "0-10",
      "0-9",
      "0-11"
    ],
    "step-5": [
      "0-11",
      "0-10",
      "0-9",
      "0-7",
      "0-1"
    ],
    "step-6": [
      "0-15",
      "0-14",
      "0-13",
      "0-12",
      "0-16"
    ]
  }
}
