{
  "id": "strawberry-sorbet-with-pistachio-parfait-and-eucalyptus-mousse",
  "title": "Strawberry sorbet with pistachio parfait and eucalyptus mousse",
  "sourceUrl": "https://www.greatbritishchefs.com/recipes/strawberry-and-olive-dessert-recipe",
  "ingredients": [
    {
      "section": "",
      "items": [
        "6 strawberries",
        "1 tsp olive oil",
        "1 tsp icing sugar",
        "8 black olives, preferably petit niçoise",
        "10g of eucalyptus leaves",
        "200g of whole milk",
        "60g of sugar",
        "100g of egg yolk",
        "1 sheet of gold gelatine",
        "190g of mascarpone",
        "90g of whipping cream, semi-whipped",
        "1g of tartaric acid",
        "95g of water",
        "3.75g of yellow pectin",
        "15g of glucose powder",
        "250g of caster sugar",
        "50g of extra virgin olive oil, preferably Arbequina Family Reserve 1780",
        "30g of pistachio paste",
        "22g of whole milk",
        "250g of strawberries",
        "100ml of water",
        "15g of caster sugar",
        "15g of Vege-Gel",
        "560g of strawberries, hulled",
        "80g of water",
        "60g of caster sugar",
        "20g of glucose",
        "2 tsp lemon juice, fresh",
        "30 wild strawberries",
        "1 handful of basil cress, preferably Greek basil"
      ]
    }
  ],
  "instructions": [
    {
      "section": "",
      "steps": [
        "For the dehydrated strawberries, remove the tops from the strawberries and cut in half. Add to a bowl with the olive oil and icing sugar and mix to coat",
        "Spread out on a mat and place in a dehydrator at 45°C for approximately 8 hours. Alternatively, you can place them in an oven at 85°C for 80 minutes, turning the tray halfway through cooking",
        "Once dried, cut the strawberries in half and set aside",
        "For the olive crumb, de-stone the olives and wash in warm water. Place in the dehydrator at 45°C for 24 hours, or place them into an oven at 85°C for 3 hours",
        "When dry, break the olives into pieces and reserve",
        "To make the eucalyptus mousse, rub the leaves between your fingers to release the flavour, add to a saucepan with the milk and bring to the boil. Cover with cling film and allow to cool",
        "Put the sugar in a heavy-based saucepan and dissolve in a small amount of water. Place over a medium heat and cook until a temperature of 116°C is reached - make sure there are no undissolved sugar crystals on the side of the pan as these could fall into the syrup and cause it to crystalise. Meanwhile, place the egg yolks into the bowl of a standing mixer",
        "Soak the gelatine leaf in cold water until softened and strain the milk infusion",
        "When the sugar reaches 116°C, begin to whisk the egg yolk on full speed. When the sugar reaches 121°C, remove from the heat and slowly pour onto the yolks in a slow stream. Do not add the sugar too fast as this will scramble the egg yolks. Whisk until cold (this is known as a 'pâte à bombe')",
        "Mix 50ml of the milk with the mascarpone until fully incorporated. Discard the rest",
        "Mix 20g of the pâte à bombe into the mascarpone mix. Reserve the rest for the pistachio parfait",
        "Melt the gelatine into a warmed tablespoon of cream and fold into the mascarpone. Whisk the rest of the cream to a soft peak and fold 25g into the mascarpone, reserving the rest for the pistachio parfait",
        "Transfer to a small container and set aside to set in the fridge. Once set, reserve the mousse in a piping bag until needed",
        "For the olive oil pâte de fruit, first line a mould measuring 19x10x0.8cm with cling film. Mix the tartaric acid with 5g of the water and leave to dissolve - you will need to move quickly once you add the tartaric acid as it will begin to set. Mix together the pectin, glucose powder and sugar",
        "Bring the water to the boil and add the sugar mixture. Cook to 107°C, then remove from the heat",
        "Whisking as quickly as possible, add the olive oil very slowly - you will need to use a small whisk for this to allow for a fast enough action",
        "Once the oil has emulsified, add the tartaric acid and pour into the prepared frame. Leave to set",
        "Once set, cut the pâte de fruit into 0.8cm squares and reserve",
        "For the pistachio parfait, start by lining a mould measuring 19x10x0.8cm. Combine the pistachio paste and milk until fully emulsified then fold in the remaining 50g of pâte à bombe and 60g of cream.",
        "Place the parfait in the freezer until set, then cut into 0.8cm squares. Reserve in the freezer",
        "For the strawberry soup, wash the strawberries, remove the tops and cut in half. Divide into two batches",
        "Place the first batch in a pan with the sugar and water, bring to the boil then cover with cling film and leave to cool",
        "Once cold, strain the liquid into a clean pan with the remaining strawberries and repeat the process. Strain the liquid and reserve",
        "For the strawberry jelly sheets, grease a metal tray measuring 50x30cm with baking spray and heat in the oven",
        "Place the soup in a small saucepan and bring to the boil. Whisk in the Vege-Gel and boil for 30 seconds",
        "Very quickly transfer the soup to the warm tray, tilting the tray back and forth and side to side until a thin and even sheet is formed. Cool in the fridge",
        "Once set, cut out the jelly circles with a 9cm cutter and place onto greaseproof paper until needed",
        "For the strawberry sorbet, blitz the strawberries in a blender for 1 minute. Place the water, sugar and glucose into a pan and place on the hob over a medium heat to dissolve the sugar. Remove from the heat and allow to chill completely",
        "Stir in the lemon juice, place in a Paco Jet container and freeze solid before processing. Alternatively, churn in an ice cream machine according to the manufacturer's instructions",
        "To plate, pipe the eucalyptus mousse in the middle of the plate and place the other ingredients around the edges of the plate. Place a quenelle of strawberry sorbet into the centre and top with a jelly sheet. Garnish with the wild strawberries and basil cress"
      ]
    }
  ],
  "expectedMatches": {
    "step-0": [
      "0-1",
      "0-0",
      "0-2",
      "0-6",
      "0-19",
      "0-15",
      "0-21",
      "0-25",
      "0-16",
      "0-28",
      "0-23"
    ],
    "step-1": [],
    "step-2": [
      "0-0",
      "0-19",
      "0-28",
      "0-23"
    ],
    "step-3": [
      "0-1",
      "0-12",
      "0-24",
      "0-20"
    ],
    "step-4": [],
    "step-5": [
      "0-4",
      "0-5",
      "0-18"
    ],
    "step-6": [
      "0-7",
      "0-2",
      "0-6",
      "0-12",
      "0-24",
      "0-15",
      "0-21",
      "0-25",
      "0-20"
    ],
    "step-7": [
      "0-5",
      "0-12",
      "0-18",
      "0-24",
      "0-8",
      "0-20"
    ],
    "step-8": [
      "0-7",
      "0-2",
      "0-6",
      "0-15",
      "0-21",
      "0-25",
      "0-28",
      "0-8"
    ],
    "step-9": [
      "0-9",
      "0-5",
      "0-18"
    ],
    "step-10": [
      "0-9",
      "0-17"
    ],
    "step-11": [
      "0-9",
      "0-8",
      "0-17"
    ],
    "step-12": [],
    "step-13": [
      "0-1",
      "0-11",
      "0-14",
      "0-26",
      "0-2",
      "0-6",
      "0-12",
      "0-24",
      "0-13",
      "0-15",
      "0-21",
      "0-25",
      "0-16",
      "0-28",
      "0-20"
    ],
    "step-14": [
      "0-2",
      "0-6",
      "0-12",
      "0-24",
      "0-15",
      "0-21",
      "0-25",
      "0-20"
    ],
    "step-15": [
      "0-1",
      "0-16",
      "0-28"
    ],
    "step-16": [
      "0-1",
      "0-11"
    ],
    "step-17": [],
    "step-18": [
      "0-17",
      "0-5",
      "0-18",
      "0-8"
    ],
    "step-19": [],
    "step-20": [
      "0-0",
      "0-19",
      "0-28",
      "0-23"
    ],
    "step-21": [
      "0-2",
      "0-6",
      "0-12",
      "0-24",
      "0-15",
      "0-21",
      "0-25",
      "0-20"
    ],
    "step-22": [
      "0-0",
      "0-19",
      "0-28",
      "0-8",
      "0-23"
    ],
    "step-23": [
      "0-0",
      "0-19",
      "0-28",
      "0-23",
      "0-8"
    ],
    "step-24": [
      "0-22"
    ],
    "step-25": [
      "0-8"
    ],
    "step-26": [],
    "step-27": [
      "0-26",
      "0-0",
      "0-2",
      "0-6",
      "0-12",
      "0-19",
      "0-24",
      "0-15",
      "0-21",
      "0-25",
      "0-20",
      "0-28",
      "0-14",
      "0-23"
    ],
    "step-28": [
      "0-27"
    ],
    "step-29": [
      "0-4",
      "0-28",
      "0-0",
      "0-19",
      "0-29",
      "0-23",
      "0-8"
    ]
  }
}
